package lesson_14;

/*
Найти элемент N в массиве из сгенерированных чисел и заменить его на минимальный элемент в массиве.
Если n не найден в массиве вывести сообщение, что элемент не найден!

пример: дано: {10,4,2,3, 1}, n = 2;.
Результат: {10,4,1,3, 1} */


public class task_2 {
    // создать массив с рандомными числами
    // указать значение числа N, n - это искомое число
    // найти индекс минимального числа в массиве и сохранить найденный индекс в переменную
    // найти в массиве число n и если оно найдено (написать функцию), сохранить индекс найденного числа n в переменную.
    // Если число n не найдено, то вывести в консоль сообщение о том, чо данного числа нет в массиве

   /* public static void main(String[] args) {
        int[] array


    } */
}
